{
  "authentication": {
    "getauthenticationdescription": "When you sign in to the Cloud BI, an authentication token is provided that should be attached in the request header(Authorization) for all subsequent API calls to authenticate the requests."
  },
  "dashbaordviewsdescription": {
    "getdashbaordviewsdescription": "To retrieve, add, update, and delete a list of dashboard views in a particular dashboard from the Cloud BI, use the corresponding endpoints below."
  },
  "attributesdescription": {
    "getattributesdescription": "To retrieve, add, update, and delete the attributes, also to customize a particular dashboard for user, group, and site, use the following corresponding endpoints."
  },
  "groupdescription": {
    "getgroupsdescription": "Use the corresponding endpoints listed below, to retrieve a list of groups, create, modify, and delete a particular group from the Cloud BI."
  },
  "userdescription": {
    "getusersdescription": "To add, retrieve, update, and delete users, a list of groups of the particular user, add CSV users, download CSV templates in the Cloud BI, use the corresponding endpoints below."
  },
  "permissiondescription": {
    "getpermissiondescription": "Use the corresponding endpoints listed below, to retrieve a list of permissions, create, and delete particular permission in the Bold BI Cloud."
  },
  "categorydescription": {
    "getcategorydescription": "To create and modify a particular category in the Cloud BI, use the corresponding endpoints below."
  },
  "slideshowdescription": {
    "getslideshowdescription": "To retrieve, create, modify and delete a particular slideshow and retrieve list of slideshows in the Cloud BI, use the corresponding endpoints below."
  },
  "scheduledescription": {
    "getscheduledescription": "To retrieve, create, and modify a particular dashboard schedule, retrieve the list of dashboard schedules, and run the schedules in the Cloud BI, use the corresponding endpoints below."
  },
  "settingsdescription": {
    "getsettingsdescription": "To modify the site settings in the Bold BI Cloud, use the corresponding endpoints below."
  },
  "pinboarddescription": {
    "getpinboarddescription": "To retrieve, create, copy, and delete a particular pinboard in the Cloud BI, use the corresponding endpoints below."
  },
  "dashboarddescription": {
    "getdashboarddescription": "To copy, retrieve, and export dashboards in the Cloud BI, use the corresponding endpoints below."
  },
  "datasourcedescription": {
    "getdatasourcedescription": "To retrieve a list of data sources, and copy a particular data source in the Cloud BI, use the corresponding endpoints below."
  },
  "draftdashboarddescription": {
    "getdraftdashboarddescription": "To retrieve a list of draft dashboards, create and modify a particular draft dashboard in the Cloud BI, use the corresponding endpoints below."
  },
  "itemdescription": {
    "getitemdescription": "To retrieve a list of items, retrieve, delete a particular item, and check a particular item name in the Cloud BI, use the corresponding endpoints below."
  }
}