{
  "authentication": {
    "getauthenticationdescription": "When you sign in to Bold BI Embed, an authentication token is provided that should be attached in the request header (Authorization) for all subsequent API calls to authenticate the requests."
  },
  "dashbaordviewsdescription": {
    "getdashbaordviewsdescription": "To retrieve, add, update, and delete a list of dashboard views in a specific dashboard from the Bold BI Embed, use the corresponding endpoints provided below."
  },
  "attributesdescription": {
    "getattributesdescription": "To retrieve, add, update, and delete attributes, as well as customize a specific dashboard for a user, group, or site, use the following corresponding endpoints."
  },
  "groupdescription": {
    "getgroupsdescription": "Please use the provided endpoints below to retrieve a list of groups, create, modify, and delete a specific group from the Bold BI Embed."
  },
  "userdescription": {
    "getusersdescription": "To add, retrieve, update, and delete users, as well as view a list of groups to which a particular user belongs, add CSV users, and download CSV templates in the Bold BI Embed, please use the corresponding endpoints below."
  },
  "permissiondescription": {
    "getpermissiondescription": "Use the provided endpoints below to retrieve a list of permissions, create, and delete specific permissions in the Bold BI Embed."
  },
  "categorydescription": {
    "getcategorydescription": "To create and modify a specific category in the Bold BI Embed, use the corresponding endpoints provided below."
  },
  "slideshowdescription": {
    "getslideshowdescription": "To retrieve, create, modify, and delete a specific slideshow and retrieve a list of slideshows in the Bold BI Embed, use the corresponding endpoints below."
  },
  "scheduledescription": {
    "getscheduledescription": "To retrieve, create, and modify a specific dashboard schedule, you can retrieve the list of dashboard schedules and run the schedules in the Bold BI Embed by using the corresponding endpoints below."
  },
  "settingsdescription": {
    "getsettingsdescription": "To modify the site settings in the Bold BI Embed, use the corresponding endpoints provided below."
  },
  "pinboarddescription": {
    "getpinboarddescription": "To retrieve, create, copy, and delete a specific pinboard in Bold BI Embed, use the corresponding endpoints provided below."
  },
  "publishdescription": {
    "getpublishdescription": "To publish a specific dashboard from one site to other site(s) in Bold BI Embed, use the corresponding endpoints provided below. Please note that this support is not available in Syncfusion Managed Cloud Server."
  },
  "dashboarddescription": {
    "getdashboarddescription": "To copy, retrieve, and export dashboards in the Bold BI Embed, please use the corresponding endpoints listed below."
  },
  "downloaddashboarddescription": {
    "getdownloaddashboarddescription": "To download dashboards in the Bold BI Embed, please use the corresponding endpoints provided below."
  },
  "uploaddashboarddescription": {
    "getuploaddashboarddescription": "To upload dashboards in the Bold BI Embed, use the corresponding endpoints provided below."
  },
  "datasourcedescription": {
    "getdatasourcedescription": "To retrieve a list of data sources and copy a particular data source in the Bold BI Embed, use the corresponding endpoints below."
  },
  "draftdashboarddescription": {
    "getdraftdashboarddescription": "To retrieve a list of draft dashboards, create and modify a specific draft dashboard in the Bold BI Embed platform, use the corresponding endpoints provided below."
  },
  "itemdescription": {
    "getitemdescription": "To retrieve a list of items, retrieve, delete a specific item, and check a specific item name in the Bold BI Embed, use the corresponding endpoints below."
  },
  "userprofiledescription":{
    "getuserprofiledescription": "Use the following endpoints to retrieve a list of user permissions and user notification settings in the Bold BI Embed."
  },
  "activitylogsdescription":
  {
    "getactivitylogsdescription":"Use the following corresponding endpoints to retrieve a list of activities performed in the Bold BI."
  },
  "webhooksdescription": 
  {
    "getwebhooksdescription": "To retrieve a list of webhooks and delete a specific webhook in Bold BI, use the following corresponding endpoints." 
  }
}